[
  {
    "name": "Aggo",
    "colorHex": "#A0F7FF",
    "defense": 22,
    "health": 13,
    "speed": 6,
    "abilities": [
      {
        "name": "Rage",
        "description": "When Aggo's combined defense and health is below 12, it gains an additional +1 damage to all damage-dealing abilities and an additional +1 movement to all movement abilities and move actions.",
        "isPassive": true
      },
      {
        "name": "Unstoppable",
        "description": "Gain 2 defense at the beginning of each turn.",
        "isPassive": true
      },
      {
        "name": "Slither",
        "description": "Melee. An adjacent target receives 2 damage. AND/OR Aggo gains 2 defense.",
        "cooldown": 0
      },
      {
        "name": "Flurry",
        "description": "Burst 1. All creatures in burst receive 3 damage.",
        "cooldown": 3
      },
      {
        "name": "Tentacle Slam",
        "description": "Line 3. All creatures in line receive 4 damage.",
        "cooldown": 4
      },
      {
        "name": "Protect Brood",
        "description": "When an ally within 8 hexes is hit by an enemy’s ability, Aggo may leap up to 8 hexes and must end the leap in the space occupied by the ally. Aggo must then push the ally into any unoccupied adjacent hex. If there are no unoccupied adjacent hexes to the targeted ally, Protect Packmate may  not be performed. Aggo then receives the ability’s effects as if he was the one targeted. If the pushed ally is still in the ability’s area of effect, Aggo and the targeted ally both  receive the ability’s effects.",
        "cooldown": 4,
        "isInterrupt": true
      },
      {
        "name": "Demonic Cackle",
        "description": "Burst 3. All enemies in burst are taunted.",
        "cooldown": 5
      },
      {
        "name": "Abduct",
        "description": "Melee reach 6. Pull a target within reach into the closest adjacent hex. The creature receives 2 damage and is immobilized. ",
        "cooldown": 5
      },
      {
        "name": "Entangling Rush",
        "description": "Melee. An adjacent target receives 2 damage. Dash up to 3 hexes and dash the target up to 4 hexes. Aggo and the target must remain adjacent for the entire movement.",
        "cooldown": 5
      },
      {
        "name": "Gather Shadows",
        "description": "Gain 7 defense.",
        "cooldown": 5
      },
      {
        "name": "Kaiju",
        "description": "Gain 3 defense. Aggo gains 3 size counters that decay by 1 each turn. Aggo grows to fill all unoccupied hexes in a burst 1. All occupied hexes have threat fields. Any ranged attacks targeting Aggo must only target the center of one of the hexes they occupy. Any area of effect abilities must fill only a single hex occupied by Aggo to take effect, but do not stack damage by hitting multiple hexes occupied by Aggo. Any ability used by Aggo may originate from any of the hexes they occupy. Any damage-dealing ability used by Aggo deals 1 additional damage. When Aggo moves in any way, they are treated as occupying only a single hex. When the movement ends, Aggo grows to fill all unoccupied hexes in a burst 1. When no size counters remain, the ability ends.",
        "cooldown": 9
      },
      {
        "name": "Overwhelm",
        "description": "Rush up to 8 hexes. All creatures in the rush receive 3 damage and are immobilized.",
        "cooldown": 6
      },
      {
        "name": "Heart of Darkness",
        "description": "Leap up to 6 hexes. Burst 2. All creatures in the burst receive 2 damage and are pulled to the closest adjacent hex.",
        "cooldown": 6
      },
      {
        "name": "Cleave",
        "description": "Melee. An adjacent target receives 8 damage. ",
        "cooldown": 6
      },
      {
        "name": "Punish",
        "description": "Melee. An adjacent target receives 5 damage and is pushed up to 4 hexes.",
        "cooldown": 6
      },
      {
        "name": "Riposte",
        "description": "Interrupt when hit by a melee ability. The adjacent creature using the ability receives 4 damage.",
        "cooldown": 7,
        "isInterrupt": true
      },
      {
        "name": "Devour Essence",
        "description": "Melee. An adjacent creature receives 9 damage. Gain 4 defense.",
        "cooldown": 9
      }
    ]
  },
  {
    "name": "Dio",
    "colorHex": "#A0A0FF",
    "defense": 14,
    "health": 10,
    "speed": 6,
    "abilities": [
      {
        "cooldown": 0,
        "name": "Hum",
        "description": "Melee. Deal 2 damage to an adjacent target. AND/OR Gain 2 defense."
      },
      {
        "cooldown": 2,
        "name": "Note of Discord",
        "description": "Ranged 10. Deal 3 damage to a target within range. May target enemies not in line of sight."
      },
      {
        "cooldown": 3,
        "name": "Turret",
        "description": "Summon a turret in an unoccupied adjacent hex. The turret has: Speed 0 (cannot move), Health 2, Defense 0, no threat aura, does not block line of sight, blocks movement. The turret's ability is: Ranged 10. Deal 2 damage to a target within range. The turret may act at any point during the players' round."
      },
      {
        "cooldown": 3,
        "name": "Quick Fix",
        "description": "Interrupt. Ranged 10. A target within range gains 3 defense. OR. Interrupt. Gain 3 defense.",
        "isInterrupt": true
      },
      {
        "cooldown": 3,
        "name": "Tether",
        "description": "Ranged 8. Summon a tether in an unoccupied hex within range. The tether has: Speed 0 (cannot move), Health 2, Defense 0, no threat aura, blocks line of sight, blocks movement. The tether uses its ability immediately: Melee reach 1. A target within reach cannot move out of a burst 1 of the tether and receives 2 damage at the end of the players' turn. Ability ends when the tether is destroyed."
      },
      {
        "cooldown": 5,
        "name": "Musical Blast",
        "description": "An adjacent target recieves 2 damage and is pushed up to 3 hexes. Dio is pushed away from the adjacent target up to 4 hexes in a line of Dio's choosing."
      },
      {
        "cooldown": 5,
        "name": "Bouncing Note",
        "description": "Ranged 5. A target within range receives 4 damage. A second ability may be used this turn, originating from the targeted creature's hex. Melee reach 5. A creature within reach receives 4 damage."
      },
      {
        "cooldown": 5,
        "name": "Unbearable Beat",
        "description": "Ranged 10 Burst 1. All creatures in burst receive 4 damage."
      },
      {
        "cooldown": 5,
        "name": "Frantic Melody",
        "description": "Dash up to 8 hexes. May dash through hexes occupied by creatures. Allies dashed through gain 2 defense. Enemies dashed through receive 2 damage. A creature cannot gain defense or receive damage more than once."
      },
      {
        "cooldown": 5,
        "name": "Song of Prosperity",
        "description": "Ranged 10. A target within range gains 6 defense. OR. Gain 6 defense."
      },
      {
        "cooldown": 6,
        "name": "Song of the Victorious",
        "description": "Cone 4. All enemies in cone receive 4 damage."
      },
      {
        "cooldown": 6,
        "name": "Rapid Rhythm",
        "description": "Dio and another ally within 8 hexes may move up to 3 hexes."
      },
      {
        "cooldown": 7,
        "name": "Bounce Pad",
        "description": "Ranged 8. Summon a bounce pad in an unoccupied hex within range. The bouce pad has: Speed 0 (cannot move), untargetable and immune, no threat aura, does not block line of sight, does not block movement. The bounce pad's ability is active as soon as it's placed: The bounce pad has 3 charge tokens. Whenever a creature moves into the bounce pad's hex a token is consumed and Dio may leap the creature up to 4 hexes. When no charges remain, the bounce pad vanishes."
      },
      {
        "cooldown": 7,
        "name": "Piper's Plan",
        "description": "Ranged 6. Dio dashes a target within range up to 5 hexes. The target and all enemies within a burst 1 receive 4 damage."
      }]
  },
    {
        "name": "Kazak",
        "colorHex": "#FFA0C3",
        "defense": 16,
        "health": 10,
        "speed": 6,
        "abilities": [
            {
                "name": "Heart of Fire",
                "description": "At the start of battle, a magic orb may be summoned in any adjacent hex as a free action. At any time during Kasak’s turn, the orb may be moved up to 3 hexes as a free action. The orb can move through or occupy the same hex as creatures, but not obstacles. At any point during the player's round, Kazak may deal 2 damage to one creature that occupies the orb’s hex. The orb may be dismissed on Kazak’s turn as a free action, but an action must be spent to resummon it in an adjacent hex.",
                "isPassive": true
            },
            {
                "cooldown": 0,
                "name": "Rock Fist",
                "description": "Melee. Deal 2 damage to an adjacent target. AND/OR gain 2 defense."
            },
            {
                "cooldown": 3,
                "name": "Elemental Displacement",
                "description": "Melee. Deal 3 damage to an adjacent target.  Teleport the target up to 3 hexes."
            },
            {
                "cooldown": 3,
                "name": "Sprint 'n Spell",
                "description": "Move up to 3 hexes. Ranged 10. A target within range receives 3 damage."
            },
            {
                "cooldown": 3,
                "name": "Ice Shards",
                "description": "Ranged 10. Deal 2 damage to up to 4 targets within range. If the targets are hit by another ability this round, they receive 2 additional damage."
            },
            {
                "cooldown": 4,
                "name": "Fire Breath",
                "description": "Cone 3. All creatures in cone receive 4 damage."
            },
            {
                "cooldown": 5,
                "name": "Meteor Shower",
                "description": "Ranged 10 Burst 1. All creatures in burst receive 5 damage."
            },
            {
                "cooldown": 6,
                "name": "Forked Fire",
                "description": "Ranged 8. Deal 4 damage to up to 2 targets within range."
            },
            {
                "cooldown": 7,
                "name": "Flicker or Fire",
                "description": "Charge 1. If Kazak is successfully targeted while charging: Interrupt. teleport up to 4 hexes and gain 5 defense. If Kazak is not successfully targeted before charge ends: Free action. Melee reach 7. A target within reach receives 8 damage."
            },
            {
                "cooldown": 6,
                "name": "Earth Wall",
                "description": "Interrupt. When Kazak or an ally is targeted by a ranged or melee reach attack:  Ranged 8. An unoccupied hex within range becomes the origin hex for a 3 hex long wall. The wall may be in any configuration from the origin hex as long as it is straight and it blocks line of sight for the ranged attack. Each wall segment has: Speed 0 (cannot move), Health 2, Defense 0,  no threat aura, blocks line of sight.",
                "isInterrupt": true
            },
            {
                "cooldown": 6,
                "name": "Earth Dragon",
                "description": "Line 3. All creatures in line receive 4 damage. All creatures in line may be pushed up to 3 hexes."
            },
            {
                "cooldown": 7,
                "name": "Emerald Lance",
                "description": "Melee reach 8. A creature within reach receives 5 damage. Place a Lance in the hex occupied by the target. The Lance may occupy hexes occupied by creatures but not obstacles. The Lance has: Speed 0 (cannot move), untargetable and immune, no threat aura, does not block line of sight."
            },
            {
                "cooldown": 0,
                "name": "Emerald Lightning",
                "description": "Cannot be used unless the Lance from the Emerald Lance ability is occupying a hex. Line 4 originating from the hex occupied by the Lance. All creatures in the line and any creatures occupying the hex with the Lance receive 4 damage. The Lance vanishes. Cooldown begins on Emerald Lance ability."
            },
            {
                "cooldown": 7,
                "name": "Incinerate",
                "description": "Ranged 10. A target within range receives 7 damage."
            },
            {
                "cooldown": 8,
                "name": "Laser",
                "description": "Line 10. All creatures in the line receive 5 damage."
            },
            {
                "cooldown": 10,
                "name": "Wind Walk",
                "description": "Teleport up to 10 hexes. Gain 6 defense."
            }
        ]
    }
]
